---
title: FailureDefinitionRegistry
classe: Autodesk.Revit.DB.FailureDefinitionRegistry
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FailureDefinitionRegistry

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `failureDefinitionRegistry.IsValidObject` | Boolean |
| `Void Dispose()` | `failureDefinitionRegistry.Dispose()` | Void |
| `FailureDefinitionAccessor FindFailureDefinition(FailureDefinitionId)` | `failureDefinitionRegistry.FindFailureDefinition(id)` | FailureDefinitionAccessor |
| `IList<FailureDefinitionAccessor> ListAllFailureDefinitions()` | `failureDefinitionRegistry.ListAllFailureDefinitions()` | IList<FailureDefinitionAccessor> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```